--###################################################################
--			dashboard options
--###################################################################

vim.g.dashboard_session_directory = "/home/areza/.config/nvim/sessions"
vim.g.dashboard_default_executive = 'telescope'
vim.g.dashboard_custom_footer = {"🎉 Have Fun with Neovim!"}

vim.g.dashboard_custom_shortcut = {
	last_session = 'SPC s l',
	find_history = 'SPC f H',
	find_file = 'SPC f f',
	new_file = 'SPC c n',
	change_colorscheme = 'SPC t c',
	find_word = 'SPC f g',
	book_marks = 'SPC f m'
}

vim.g.dashboard_custom_header = {
'                                                       ',
'                                                       ',
' ███╗   ██╗ ███████╗ ██████╗  ██╗   ██╗ ██╗ ███╗   ███╗',
' ████╗  ██║ ██╔════╝██╔═══██╗ ██║   ██║ ██║ ████╗ ████║',
' ██╔██╗ ██║ █████╗  ██║   ██║ ██║   ██║ ██║ ██╔████╔██║',
' ██║╚██╗██║ ██╔══╝  ██║   ██║ ╚██╗ ██╔╝ ██║ ██║╚██╔╝██║',
' ██║ ╚████║ ███████╗╚██████╔╝  ╚████╔╝  ██║ ██║ ╚═╝ ██║',
' ╚═╝  ╚═══╝ ╚══════╝ ╚═════╝    ╚═══╝   ╚═╝ ╚═╝     ╚═╝',
}



